tap "azure/kubelogin"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "microsoft/mssql-release"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Automate deployment, configuration, and upgrading
brew "ansible"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Run arbitrary commands when files change
brew "entr"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# OpenType text shaping engine
brew "harfbuzz"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Postgres C API library
brew "libpq"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Framework for layout and rendering of i18n text
brew "pango"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "angular.ng-template"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bazelbuild.vscode-bazel"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-speech"
vscode "nrwl.angular-console"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
